diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонетскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Catalog.ДоговорыКонтрагентов</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_РаботыВыполненныеКлиенту</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/CommonModules/ВКМ_МассовоеСозданиеРеализаций/Module.bsl
#Область ПрограммныйИнтерфейс

//Находит действующие в указанном периоде договоры
//Параметры:
//Параметры - Структура
//АдресРезультата - УникальныйИдентификатор
Процедура ВКМ_НайтиДоговорыДляЗаполнения(Параметры, АдресРезультата)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец.Ссылка КАК Контрагент,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаДоговора,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Основание)
	|		И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|		И (РеализацияТоваровУслуг.Проведен)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора.Ссылка = &ВидДоговора
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &НачалоПериода";
	
	
    Запрос.УстановитьПараметр("НачалоПериода", Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонетскоеОбслуживание);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.ДатаОкончания);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ПоместитьВоВременноеХранилище(ТаблицаРезультат, АдресРезультата);
	
КонецПроцедуры


//Создает и проводит Документы Реализации по договорам
//Параметры:
//Параметры - Структура
//АдресРезультата - УникальныйИдентификатор
Процедура ВКМ_СоздатьРеализацииКДоговорам(Параметры, АдресРезультата) Экспорт
	ТаблицаДанных = Параметры.Таблица ;
	ДокументовСоздано = 0;
	ДокументовИзменено = 0;
	ТекстСообщения = "";

	Для Каждого СтрокаТЧ Из ТаблицаДанных Цикл
		Если СтрокаТЧ.Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Заполнить(СтрокаТЧ.Договор);
			НовыйДокумент.Дата = Параметры.ДатаОкончания;
			НовыйДокумент.ВКМ_ВыполнитьЗаполнение();
			НовыйДокумент.Комментарий = "##Выполнено обработкой Массовое создание реализаций##";
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, );
			
			СтрокаТЧ.Реализация = НовыйДокумент.Ссылка;
			
			ДокументовСоздано = ДокументовСоздано + 1;
		Иначе
			ДокТЧ = СтрокаТЧ.Реализация.ПолучитьОбъект();
			ДокТЧ.Заполнить(СтрокаТЧ.Договор);
			ДокТЧ.Дата = Параметры.ДатаОкончания;
			ДокТЧ.ВКМ_ВыполнитьЗаполнение();
			ДокТЧ.Комментарий = ДокТЧ.Комментарий + "##Изменено обработкой Массовое создание реализаций";
			ДокТЧ.Записать(РежимЗаписиДокумента.Проведение, );
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументовСоздано > 0 Тогда
		ТекстСообщения = СтрШаблон("Успешно создано %1 документов!", ДокументовСоздано);
	КонецЕсли;
	Если ДокументовИзменено > 0 Тогда
		ТекстСообщения = ТекстСообщения + СтрШаблон("Изменено %1 документов!", ДокументовИзменено);
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	ПоместитьВоВременноеХранилище(ТаблицаДанных, АдресРезультата);
	

КонецПроцедуры

#КонецОбласти
